docs/ColorSchemes.org
# -*- Mode:Org; Coding:utf-8; fill-column:158 -*-
# ######################################################################################################################################################.H.S.##
# FILE:        ColorSchemes.org
#+TITLE:       Color Schemes
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DATE:        2022-07-31
#+DESCRIPTION: DESCRIPTION FIXME
#+KEYWORDS:    KEYWORDS FIXME
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil 
#+SEQ_TODO:    TODO:NEW(t)                         TODO:WORK(w)    TODO:HOLD(h)    | TODO:FUTURE(f)   TODO:DONE(d)    TODO:CANCELED(c)
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
#+HTML_HEAD: <style>body { min-width: 500px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>.subtitle { font-size: 0.6em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
#+HTML_HEAD: <style>.org-src-container>pre:before { display: block; position: absolute; background-color: #b3b3b3; top: 0; right: 0; padding: 0 0.2em 0 0.4em; border-bottom-left-radius: 8px; border: 0; color: white; font-size: 100%; font-family: Helvetica, sans-serif;}</style>
#+HTML_HEAD: <style>pre.example { white-space: pre-wrap; white-space: -moz-pre-wrap; white-space: -o-pre-wrap; font-family: Lucida Console, monospace; font-size: 80%; background: #404040; color: white; display: block; padding: 0em; border: 2px solid black; }</style>
#+HTML_LINK_HOME: https://www.mitchr.me/
#+HTML_LINK_UP: https://www.mitchr.me/FIXME
# ######################################################################################################################################################.H.E.##

#+ATTR_HTML: :border 2 solid #ccc :frame hsides :align center
|          <r> | <l>                                          |
|    *Author:* | /{{{author}}}/                               |
|   *Updated:* | /{{{modification-time(%Y-%m-%d %H:%M:%S)}}}/ |
| *Generated:* | /{{{time(%Y-%m-%d %H:%M:%S)}}}/              |
#+ATTR_HTML: :align center
Copyright \copy {{{time(%Y)}}} Mitch Richling. All rights reserved.

#+TOC: headlines 5

#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#   010  #    020  #    030  #    040  #    050  #    060  #    070  #    080  #    090  #    100  #    110  #    120  #    130  #    140  #    150  #    160  #    170  #    180  #    190  #    200  #    210  #    220  #    230  #    240  #    250  #    260  #    270  #    280  #    290  #
# 345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #       | #         #         #         #         #         #         #         #         #         #         #         #         #         #
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #       | #         #         #         #         #         #         #         #         #         #         #         #         #         #

# To get org to evaluate all code blocks on export, add the following to the Emacs header on the first line of this file:
#     org-export-babel-evaluate:t; org-confirm-babel-evaluate:nil
#
# C-c C-x C-v (org-toggle-inline-images)
#

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

*=MRaster=* provides access to a rich collection of color schemes.  Color schemes are exposed in the API as inner classes of the =colorTpl= class.  These
inner classes follow a regular naming convention:

  - =csCB ..........= RGB Color Brewer 2 (template: =csCB_tpl=
  - =csFPwebSafe ...= RGB Web safe colors (template: =csFP_tpl=
  - =csCCdiag ......= RGB color cube: diagonal gradients (template: =csCC_tpl=)
  - =csCCcons ......= RGB color cube: Gradients with constant brightness (template: =csCC_tpl=)
  - =csCColde ......= RGB color cube: Some classic color gradients (template: =csCC_tpl=)
  - =csCCud ........= RGB color cube: Two color up-down ramps (template: =csCC_tpl=)
  - =csCCSum .......= RGB color cube: Sum ramp (template: =csCC_tpl=)
  - =csHSLh ........= RGB color cube: Gradients starting at the center of the cube and extending to a corner
  - =csBin .........= RGB Binary Schemes (template: =csCC_tpl=)
  - =csPGrey .......= RGB Pseudo-greyscale
  - =csRainbow .....= RGB spectrum based colors

These classes are static in nature, and an instance is not required to use them.  They all have a member named "=c=" which is used to set the components of a
=colorTpl= instance passed as argument, or as a factory for =colorTpl= instances.

When used as a factory, color scheme classes return fully constructed  =colorTpl=  objects:

#+begin_src c++
mjr:color3c8b aColor = mjr::color3c8b::webSafeNormalVision.c(25);
#+end_src

Alternately, color scheme classes may set the components of a passed  =colorTpl=  instance:

#+begin_src c++
mjr::color3c8b aColor;
mjr::color3c8b::webSafeNormalVision.c(aColor, 25);
#+end_src

Color scheme classes may also be used by =colorTpl= methods to identify a color scheme.  For example, the =csSet= method can set the current object's
components based on a color scheme like so:

#+begin_src c++
mjr::color3c8b aColor;
aColor.csSet<mjr::color3c8b::webSafeNormalVision>(25);
#+end_src

