docs/ColorSchemes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-02 Tue 14:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=1024, initial-scale=1" />
<title>Color Schemes</title>
<meta name="author" content="Mitch Richling" />
<meta name="description" content="DESCRIPTION FIXME" />
<meta name="keywords" content="KEYWORDS FIXME" />
<meta name="generator" content="Org Mode" />














</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://www.mitchr.me/FIXME"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Color Schemes</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2022-08-02 14:11:07</i></td>
</tr>

<tr>
<td class="org-right"><b>Generated:</b></td>
<td class="org-left"><i>2022-08-02 14:11:08</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright &copy; 2022 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a>
<ul>
<li><a href="#org659fd15">1.1. Color Scheme Class Interface</a></li>
</ul>
</li>
<li><a href="#orgdcdf3dc">2. Color Cube Edge/Diagonal Graph Color Schemes</a>
<ul>
<li><a href="#orge274d81">2.1. The Color Cube Rainbow</a></li>
<li><a href="#orgd64514a">2.2. Hitting all the corners</a></li>
<li><a href="#org9a39e24">2.3. Hot Too Cold</a></li>
<li><a href="#org540bd45">2.4. Constant Intensity Cycles</a></li>
<li><a href="#org82e35b2">2.5. One Segment Diverging Maps</a></li>
<li><a href="#org03bf917">2.6. Three Segment Diverging Maps</a></li>
<li><a href="#org28ba40c">2.7. Center point ramps (HSL schemes)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
<b><code>MRaster</code></b> provides access to a rich collection of color schemes.  Color schemes are exposed in the API as inner classes of the <code>colorTpl</code> class.  These
inner classes follow a regular naming convention:
</p>

<ul class="org-ul">
<li><code>csCB ..........</code> RGB Color Brewer 2 (template: <code>csCB_tpl</code></li>
<li><code>csFPwebSafe ...</code> RGB Web safe colors (template: <code>csFP_tpl</code></li>
<li><code>csCCdiag ......</code> RGB color cube: diagonal gradients (template: <code>csCC_tpl</code>)</li>
<li><code>csCCcons ......</code> RGB color cube: Gradients with constant brightness (template: <code>csCC_tpl</code>)</li>
<li><code>csCColde ......</code> RGB color cube: Some classic color gradients (template: <code>csCC_tpl</code>)</li>
<li><code>csCCud ........</code> RGB color cube: Two color up-down ramps (template: <code>csCC_tpl</code>)</li>
<li><code>csCCSum .......</code> RGB color cube: Sum ramp (template: <code>csCC_tpl</code>)</li>
<li><code>csHSLh ........</code> RGB color cube: Gradients starting at the center of the cube and extending to a corner</li>
<li><code>csBin .........</code> RGB Binary Schemes (template: <code>csCC_tpl</code>)</li>
<li><code>csPGrey .......</code> RGB Pseudo-greyscale</li>
<li><code>csRainbow .....</code> RGB spectrum based colors</li>
</ul>

<p>
These classes are static in nature, and an instance is not required to use them.  They all have a member named "<code>c</code>" which is used to set the components of a
<code>colorTpl</code> instance passed as argument, or as a factory for <code>colorTpl</code> instances.
</p>

<p>
When used as a factory, color scheme classes return fully constructed  <code>colorTpl</code>  objects:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8470ff; font-weight: bold;">mjr</span>:<span style="color: #63b8ff;">color3c8b</span> <span style="color: #7fffd4;">aColor</span> = <span style="color: #8470ff; font-weight: bold;">mjr</span>::<span style="color: #8470ff; font-weight: bold;">color3c8b</span>::webSafeNormalVision.c(25);
</pre>
</div>

<p>
Alternately, color scheme classes may set the components of a passed  <code>colorTpl</code>  instance:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8470ff; font-weight: bold;">mjr</span>::<span style="color: #63b8ff;">color3c8b</span> <span style="color: #7fffd4;">aColor</span>;
<span style="color: #8470ff; font-weight: bold;">mjr</span>::<span style="color: #8470ff; font-weight: bold;">color3c8b</span>::webSafeNormalVision.c(aColor, 25);
</pre>
</div>

<p>
Color scheme classes may also be used by <code>colorTpl</code> methods to identify a color scheme.  For example, the <code>csSet</code> method can set the current object's
components based on a color scheme like so:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8470ff; font-weight: bold;">mjr</span>::<span style="color: #63b8ff;">color3c8b</span> <span style="color: #7fffd4;">aColor</span>;
aColor.csSet&lt;<span style="color: #8470ff; font-weight: bold;">mjr</span>::<span style="color: #8470ff; font-weight: bold;">color3c8b</span>::webSafeNormalVision&gt;(25);
</pre>
</div>
</div>
