docs/ColorSchemes.org
** Color Scheme Class Interface

Not all color scheme classes have the same interface; however, the interfaces are uniformly designed:
  - *=numC=:* The number of colors available in the scheme 
    - Color schemes with a fixed number of colors at compile time have member =numC=
    - Color schemes with the number of colors set at run time, will have a =numC= argument for the =c= methods.
      - These schemes have two members specifying the range for =numC=: =minNumC= & =maxNumC=.
  - *=c=:* methods are used to set colors
    - All color schemes have a =colorTpl= factory methodand a =colorTpl= setter method taking a =colorTpl= instance as the first argument with the remaining arguments identical to the factory method.
    - The arguments for the =c= method vary according to the needs of the scheme.  For example:
      - =csCB*= color schemes take an =Nc= argument followed by a =csIdx=.
      - =csCC*= color schemes take a =csIdx= -- the =Nc= value being fixed at compile time.
      - The =csIdx= argument may be one of several types depending on the scheme:
        - *=csIntType=:* An integer type used to to select colors from discrete schemes (like Colorbrewer schemes).  When =clrChanT= is integral, gradient schemes can be considerd discrete as well.
        - *=csFltType=:* An floating point type used to select colors from continuous schemes (like gradiants).
        - *=csNatType=:* This will be =csIntType= when  =clrChanT= is integral, and =csFltType= otherwise.  It is used by =csHSLh*= schemes.

Many color schemes provide a number of colors that is a function of =chanStepMax=, which is directly related to the value of =clrChanT=.  For integral
=clrChanT= types, =chanStepMax= will be equal to =maxChanVal=. For floating point =clrChanT= types, =chanStepMax= will be equal to $2^32$.

* Color Cube Edge/Diagonal Graph Color Schemes

 The RGB color cube:

#+begin_src text
.                                                       _________________________
.                                                green / _____________________  /| yellow
.                                                     / / ___________________/ / |
.                                                    / / /| |               / /  |
.                                                   / / / | |              / / . |
.                                                  / / /| | |             / / /| |
.                                                 / / / | | |            / / / | |
.                                                / / /  | | |     white / / /| | |
.                                               / /_/__________________/ / / | | |
.                                              /________________________/ /  | | |
.                                         cyan | ______________________ | |  | | |
.                                              | | |    | | |_________| | |__| | |
.                                              | | |    | |___________| | |____| |
.                                              | | |   / / ___________| | |_  / / red
.                                              | | |  / / /           | | |/ / /
.                                              | | | / / /  black     | | | / /
.                                              | | |/ / /             | | |/ /
.                                              | | | / /              | | ' /
.                                              | | |/_/_______________| |  /
.                                              | |____________________| | /
.                                         blue |________________________|/ magenta
.                           
.                                       Vertexes and Center of the RGB Color Cube:
.                                       Name     R     G     B     Abriv
.                                       black    0.0   0.0   0.0   0
.                                       blue     0.0   0.0   1.0   b
.                                       green    0.0   1.0   0.0   g
.                                       red      1.0   0.0   0.0   r
.                                       yellow   1.0   1.0   0.0   y
.                                       cyan     0.0   1.0   1.0   c
.                                       magenta  1.0   0.0   1.0   m
.                                       white    1.0   1.0   1.0   w
.                                       grey50   0.5   0.5   0.5   h
#+end_src

 The edges of the cube taken with the corners as vertexes form a graph (referred to as "the cube edge graph" in this documentation).  Every trail (a walk with
 unique edges) with $n$ edges generates a color scheme with $\mathrm{maxChanVal}\cdot n - 1$ unique colors.  To make this scheme unique, we define the tree to
 have one of its end points the "start" of the scheme -- so we can map the integers from $[0,\mathrm{maxChanVal}\cdot n]$ to unique colors.

 Example:

#+BEGIN_QUOTE
    ="BCG"= defines a trail starting at =B= (blue), moving to =C= (cyan) next, and ending at =G= (green).  The color scheme has $0$ mapped to blue (the first
    vertex), $256$ mapped to cyan (the second vertex), and $511$ mapped to green (the final vertex).  For values between two vertex points, we linearly
    interpolate between the two values.
#+END_QUOTE

 If we expand the graph to also include edges between the diagonal points of each face (cyan to yellow for example), we have a larger graph with more options.
 This graph is referred to as "the face edge/diagonal graph" in this documentation.

 Color schemes defined in this way have several advantages, but they can be misleading because our perception of color change is non-linear in the RGB cube.
 We illustrate several useful and/or commonly used face edge/diagonal graph color schemes.

 Lastly, we can expand that graph by adding one vertex, called =h=, at the center of the cube with edges extending to each corner.  This graph is referred to
 as "complete cube graph with center" in this documentation.

** The Color Cube Rainbow

 This is one of the most commonly seen color schemes in scientific visualization, and it is also one of the worst because it can be misleading when
 mapped to linear values.

 The color cube rainbow map is generated by the unique six segment (6 vertex) cycle in the face edge graph not involving white or black:

  - =RYGCBMR= -- =csCColdeRainbow=

 If we expand to the edge face/diagonal graph, then we have may more six segment cycles not involving white or black:

  - =RBCGYMR=
  - =RBCMYGR=
  - =RBGCMYR=
  - =RBGCYMR=
  - =RBGYCMR=
  - =RBMCGYR=
  - =RBMCYGR=
  - =RBMYCGR=
  - =RGBCMYR=
  - =RGBCYMR=
  - =RGBMCYR=
  - =RGCBMYR=
  - =RGYCBMR=
  - =RMBGCYR=
  - =RMCBGYR=

