docs/ColorSchemes.html

<div id="outline-container-org659fd15" class="outline-3">
<h3 id="org659fd15"><span class="section-number-3">1.1.</span> Color Scheme Class Interface</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Not all color scheme classes have the same interface; however, the interfaces are uniformly designed:
</p>
<ul class="org-ul">
<li><b><code>numC</code>:</b> The number of colors available in the scheme 
<ul class="org-ul">
<li>Color schemes with a fixed number of colors at compile time have member <code>numC</code></li>
<li>Color schemes with the number of colors set at run time, will have a <code>numC</code> argument for the <code>c</code> methods.
<ul class="org-ul">
<li>These schemes have two members specifying the range for <code>numC</code>: <code>minNumC</code> &amp; <code>maxNumC</code>.</li>
</ul></li>
</ul></li>
<li><b><code>c</code>:</b> methods are used to set colors
<ul class="org-ul">
<li>All color schemes have a <code>colorTpl</code> factory methodand a <code>colorTpl</code> setter method taking a <code>colorTpl</code> instance as the first argument with the remaining arguments identical to the factory method.</li>
<li>The arguments for the <code>c</code> method vary according to the needs of the scheme.  For example:
<ul class="org-ul">
<li><code>csCB*</code> color schemes take an <code>Nc</code> argument followed by a <code>csIdx</code>.</li>
<li><code>csCC*</code> color schemes take a <code>csIdx</code> &#x2013; the <code>Nc</code> value being fixed at compile time.</li>
<li>The <code>csIdx</code> argument may be one of several types depending on the scheme:
<ul class="org-ul">
<li><b><code>csIntType</code>:</b> An integer type used to to select colors from discrete schemes (like Colorbrewer schemes).  When <code>clrChanT</code> is integral, gradient schemes can be considerd discrete as well.</li>
<li><b><code>csFltType</code>:</b> An floating point type used to select colors from continuous schemes (like gradiants).</li>
<li><b><code>csNatType</code>:</b> This will be <code>csIntType</code> when  <code>clrChanT</code> is integral, and <code>csFltType</code> otherwise.  It is used by <code>csHSLh*</code> schemes.</li>
</ul></li>
</ul></li>
</ul></li>
</ul>

<p>
Many color schemes provide a number of colors that is a function of <code>chanStepMax</code>, which is directly related to the value of <code>clrChanT</code>.  For integral
<code>clrChanT</code> types, <code>chanStepMax</code> will be equal to <code>maxChanVal</code>. For floating point <code>clrChanT</code> types, <code>chanStepMax</code> will be equal to \(2^32\).
</p>
</div>
</div>
</div>

<div id="outline-container-orgdcdf3dc" class="outline-2">
<h2 id="orgdcdf3dc"><span class="section-number-2">2.</span> Color Cube Edge/Diagonal Graph Color Schemes</h2>
<div class="outline-text-2" id="text-2">
<p>
The RGB color cube:
</p>

<div class="org-src-container">
<pre class="src src-text">.                                                       _________________________
.                                                green / _____________________  /| yellow
.                                                     / / ___________________/ / |
.                                                    / / /| |               / /  |
.                                                   / / / | |              / / . |
.                                                  / / /| | |             / / /| |
.                                                 / / / | | |            / / / | |
.                                                / / /  | | |     white / / /| | |
.                                               / /_/__________________/ / / | | |
.                                              /________________________/ /  | | |
.                                         cyan | ______________________ | |  | | |
.                                              | | |    | | |_________| | |__| | |
.                                              | | |    | |___________| | |____| |
.                                              | | |   / / ___________| | |_  / / red
.                                              | | |  / / /           | | |/ / /
.                                              | | | / / /  black     | | | / /
.                                              | | |/ / /             | | |/ /
.                                              | | | / /              | | ' /
.                                              | | |/_/_______________| |  /
.                                              | |____________________| | /
.                                         blue |________________________|/ magenta
.                           
.                                       Vertexes and Center of the RGB Color Cube:
.                                       Name     R     G     B     Abriv
.                                       black    0.0   0.0   0.0   0
.                                       blue     0.0   0.0   1.0   b
.                                       green    0.0   1.0   0.0   g
.                                       red      1.0   0.0   0.0   r
.                                       yellow   1.0   1.0   0.0   y
.                                       cyan     0.0   1.0   1.0   c
.                                       magenta  1.0   0.0   1.0   m
.                                       white    1.0   1.0   1.0   w
.                                       grey50   0.5   0.5   0.5   h
</pre>
</div>

<p>
The edges of the cube taken with the corners as vertexes form a graph (referred to as "the cube edge graph" in this documentation).  Every trail (a walk with
unique edges) with \(n\) edges generates a color scheme with \(\mathrm{maxChanVal}\cdot n - 1\) unique colors.  To make this scheme unique, we define the tree to
have one of its end points the "start" of the scheme &#x2013; so we can map the integers from \([0,\mathrm{maxChanVal}\cdot n]\) to unique colors.
</p>

<p>
Example:
</p>

<blockquote>
<p>
<code>"BCG"</code> defines a trail starting at <code>B</code> (blue), moving to <code>C</code> (cyan) next, and ending at <code>G</code> (green).  The color scheme has \(0\) mapped to blue (the first
vertex), \(256\) mapped to cyan (the second vertex), and \(511\) mapped to green (the final vertex).  For values between two vertex points, we linearly
interpolate between the two values.
</p>
</blockquote>

<p>
If we expand the graph to also include edges between the diagonal points of each face (cyan to yellow for example), we have a larger graph with more options.
This graph is referred to as "the face edge/diagonal graph" in this documentation.
</p>

<p>
Color schemes defined in this way have several advantages, but they can be misleading because our perception of color change is non-linear in the RGB cube.
We illustrate several useful and/or commonly used face edge/diagonal graph color schemes.
</p>

<p>
Lastly, we can expand that graph by adding one vertex, called <code>h</code>, at the center of the cube with edges extending to each corner.  This graph is referred to
as "complete cube graph with center" in this documentation.
</p>
</div>

<div id="outline-container-orge274d81" class="outline-3">
<h3 id="orge274d81"><span class="section-number-3">2.1.</span> The Color Cube Rainbow</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is one of the most commonly seen color schemes in scientific visualization, and it is also one of the worst because it can be misleading when
mapped to linear values.
</p>

<p>
The color cube rainbow map is generated by the unique six segment (6 vertex) cycle in the face edge graph not involving white or black:
</p>

<ul class="org-ul">
<li><code>RYGCBMR</code> &#x2013; <code>csCColdeRainbow</code></li>
</ul>

<p>
If we expand to the edge face/diagonal graph, then we have may more six segment cycles not involving white or black:
</p>

<ul class="org-ul">
<li><code>RBCGYMR</code></li>
<li><code>RBCMYGR</code></li>
<li><code>RBGCMYR</code></li>
<li><code>RBGCYMR</code></li>
<li><code>RBGYCMR</code></li>
<li><code>RBMCGYR</code></li>
<li><code>RBMCYGR</code></li>
<li><code>RBMYCGR</code></li>
<li><code>RGBCMYR</code></li>
<li><code>RGBCYMR</code></li>
<li><code>RGBMCYR</code></li>
<li><code>RGCBMYR</code></li>
<li><code>RGYCBMR</code></li>
<li><code>RMBGCYR</code></li>
<li><code>RMCBGYR</code></li>
</ul>
</div>
</div>
