docs/ColorSchemes.org
** Hitting all the corners

  A common request is for a cycle in the face edge graph that uses every corner color of the RGB cube.  Not only do we have one, but 6 uniquely
  different ones -- not counting rearrangements or reversals:

   - =0BCGYWMR0=
   - =0BCWMRYG0=
   - =0BMRYWCG0=
   - =0BMWCGYR0=
   - =0GCBMWYR0=
   - =0GYWCBMR0=

  Another common request is for trees (so no color is used twice) starting at black and ending at white.  Several trees exist of lengths of 7 and 5:

   - =0BCGYRMW=
   - =0BMRYGCW=
   - =0GCBMRYW=
   - =0GYRMBCW=
   - =0RMBCGYW=
   - =0RYGCBMW=
   - =0BCGYW=
   - =0BMRYW=
   - =0GCBMW=
   - =0GYRMW=
   - =0RMBCW=
   - =0RYGCW=

  The three segment trees from black to white are useful in that the intensity (sum of the components) is a monotone increasing function from zero up to
  three.  One of them (0RYW) is often called the "fire ramp" as it ranges from black (flame base), up to yellow, then red, and finally to white hot.

   - =0BCW= -- =csCCsumBGR=
   - =0BMW= -- =csCCsumBRG=
   - =0GCW= -- =csCCsumGBR=
   - =0GYW= -- =csCCsumGRB=
   - =0RMW= -- =csCCsumRBG=
   - =0RYW= -- =csCCsumRGB= and =csCColdeFireRamp=

  Luminance based color schemes from the HSL color space are quite popular.  Some HSL schemes don't suffer from the perceptional non-linearity that some
  popular RGB schemes suffer from. What most people don't realize is that many of the most popular luminance based color schemes in the HSL color space are
  actually edge graphs in the RGB color cube!  It is also true that the most common "bad" color scheme in the RGB cube (the colorCubeRainbow), is an edge
  graph in the HSL hexcone!  In the end, the thing to remember is that both color spaces have both good and bad color schemes.  Of particular note, are the
  two segment trees from black to white in the RGB edge/diagonal graph -- they are the same as the two segment graphs in the edges of the HSL hexcone from
  black to white!

   - =0RW= -- H=0   red edge of the HSL hexcone
   - =0YW= -- H=60  yellow edge of the HSL hexcone
   - =0GW= -- H=120 green edge of the HSL hexcone
   - =0CW= -- H=180 cyan edge of the HSL hexcone
   - =0BW= -- H=240 blue edge of the HSL hexcone
   - =0MW= -- H=300 magenta edge of the HSL hexcone

** Hot Too Cold

 A very common color map used to map data with ranges from cold up to hot is known as the "cold too hot ramp".  This ramp provides colors from blue, up
 through green, and ends in red. It suffers from the same defects as the color cube rainbow; however, its use is so common that special support is provided
 via a named method.

  - "BCGYR" -- =csCColdeColdToHot=

 The traditional cold to hot ramp can be improved -- this is my personal opinion.  This new ramp still has the same problems the color cube rainbow has;
 however, it is more attractive.  This one moves from white (ice), up to water (blue), and then up to red (hot) via yellow.

  - =WCBYR= -- =csCColdeIceToWaterToHot=

** Constant Intensity Cycles

 Two cycles, with three edges each, exhibiting constant intensity for every color in the color scheme are genuinely useful.  They have the advantage that they
 always render a "bright" color.  The lower intensity version is best for projected media that don't do well with yellow.

  - =CMY= -- =csCCconsTwo= -- intensity == 2
  - =BRG= -- =csCCconsOne= -- intensity == 1

** One Segment Diverging Maps

 One edge trees in the face diagonal graph with a nearly constant intensity of 2 along the entire edge are useful for "diverging" or "bipolar" color
 schemes.  By definition, such color schemes will never involve black or white.

 While rarely used, the following maps are useful and suggested.  None of them have the problems associated with the color cube rainbow.

  - =YC= -- =csCCudBr=
  - =YM= -- =csCCudBg=
  - =MC= -- =csCCudGr=
  - =MY= -- =csCCudGb=
  - =CM= -- =csCCudRg=
  - =CY= -- =csCCudRb=

 The naming convention for the methods is not obvious.  Take, for example, setRGBcmpUpDownRampBr.  This is so named because of the computational algorithm
 used to compute the scheme: Blue up, red down, green constant (maxChanVal).

** Three Segment Diverging Maps

 Some three edge trees utilizing very different colors for starting and terminal points can form very nice "divergent" color maps.  Such maps can
 successfully illustrate variables with both positive and negative values or two mutually exclusive, opposing variables.  Only two are directly
 supported via named methods (selected for attractiveness):

  - =BWR= -- intensity between 1 and 3
  - =CWM= -- intensity between 2 and 3

