docs/ColorSchemes.html

<div id="outline-container-orgd64514a" class="outline-3">
<h3 id="orgd64514a"><span class="section-number-3">2.2.</span> Hitting all the corners</h3>
<div class="outline-text-3" id="text-2-2">
<p>
A common request is for a cycle in the face edge graph that uses every corner color of the RGB cube.  Not only do we have one, but 6 uniquely
different ones &#x2013; not counting rearrangements or reversals:
</p>

<ul class="org-ul">
<li><code>0BCGYWMR0</code></li>
<li><code>0BCWMRYG0</code></li>
<li><code>0BMRYWCG0</code></li>
<li><code>0BMWCGYR0</code></li>
<li><code>0GCBMWYR0</code></li>
<li><code>0GYWCBMR0</code></li>
</ul>

<p>
Another common request is for trees (so no color is used twice) starting at black and ending at white.  Several trees exist of lengths of 7 and 5:
</p>

<ul class="org-ul">
<li><code>0BCGYRMW</code></li>
<li><code>0BMRYGCW</code></li>
<li><code>0GCBMRYW</code></li>
<li><code>0GYRMBCW</code></li>
<li><code>0RMBCGYW</code></li>
<li><code>0RYGCBMW</code></li>
<li><code>0BCGYW</code></li>
<li><code>0BMRYW</code></li>
<li><code>0GCBMW</code></li>
<li><code>0GYRMW</code></li>
<li><code>0RMBCW</code></li>
<li><code>0RYGCW</code></li>
</ul>

<p>
The three segment trees from black to white are useful in that the intensity (sum of the components) is a monotone increasing function from zero up to
three.  One of them (0RYW) is often called the "fire ramp" as it ranges from black (flame base), up to yellow, then red, and finally to white hot.
</p>

<ul class="org-ul">
<li><code>0BCW</code> &#x2013; <code>csCCsumBGR</code></li>
<li><code>0BMW</code> &#x2013; <code>csCCsumBRG</code></li>
<li><code>0GCW</code> &#x2013; <code>csCCsumGBR</code></li>
<li><code>0GYW</code> &#x2013; <code>csCCsumGRB</code></li>
<li><code>0RMW</code> &#x2013; <code>csCCsumRBG</code></li>
<li><code>0RYW</code> &#x2013; <code>csCCsumRGB</code> and <code>csCColdeFireRamp</code></li>
</ul>

<p>
Luminance based color schemes from the HSL color space are quite popular.  Some HSL schemes don't suffer from the perceptional non-linearity that some
popular RGB schemes suffer from. What most people don't realize is that many of the most popular luminance based color schemes in the HSL color space are
actually edge graphs in the RGB color cube!  It is also true that the most common "bad" color scheme in the RGB cube (the colorCubeRainbow), is an edge
graph in the HSL hexcone!  In the end, the thing to remember is that both color spaces have both good and bad color schemes.  Of particular note, are the
two segment trees from black to white in the RGB edge/diagonal graph &#x2013; they are the same as the two segment graphs in the edges of the HSL hexcone from
black to white!
</p>

<ul class="org-ul">
<li><code>0RW</code> &#x2013; H=0   red edge of the HSL hexcone</li>
<li><code>0YW</code> &#x2013; H=60  yellow edge of the HSL hexcone</li>
<li><code>0GW</code> &#x2013; H=120 green edge of the HSL hexcone</li>
<li><code>0CW</code> &#x2013; H=180 cyan edge of the HSL hexcone</li>
<li><code>0BW</code> &#x2013; H=240 blue edge of the HSL hexcone</li>
<li><code>0MW</code> &#x2013; H=300 magenta edge of the HSL hexcone</li>
</ul>
</div>
</div>

<div id="outline-container-org9a39e24" class="outline-3">
<h3 id="org9a39e24"><span class="section-number-3">2.3.</span> Hot Too Cold</h3>
<div class="outline-text-3" id="text-2-3">
<p>
A very common color map used to map data with ranges from cold up to hot is known as the "cold too hot ramp".  This ramp provides colors from blue, up
through green, and ends in red. It suffers from the same defects as the color cube rainbow; however, its use is so common that special support is provided
via a named method.
</p>

<ul class="org-ul">
<li>"BCGYR" &#x2013; <code>csCColdeColdToHot</code></li>
</ul>

<p>
The traditional cold to hot ramp can be improved &#x2013; this is my personal opinion.  This new ramp still has the same problems the color cube rainbow has;
however, it is more attractive.  This one moves from white (ice), up to water (blue), and then up to red (hot) via yellow.
</p>

<ul class="org-ul">
<li><code>WCBYR</code> &#x2013; <code>csCColdeIceToWaterToHot</code></li>
</ul>
</div>
</div>

<div id="outline-container-org540bd45" class="outline-3">
<h3 id="org540bd45"><span class="section-number-3">2.4.</span> Constant Intensity Cycles</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Two cycles, with three edges each, exhibiting constant intensity for every color in the color scheme are genuinely useful.  They have the advantage that they
always render a "bright" color.  The lower intensity version is best for projected media that don't do well with yellow.
</p>

<ul class="org-ul">
<li><code>CMY</code> &#x2013; <code>csCCconsTwo</code> &#x2013; intensity == 2</li>
<li><code>BRG</code> &#x2013; <code>csCCconsOne</code> &#x2013; intensity == 1</li>
</ul>
</div>
</div>

<div id="outline-container-org82e35b2" class="outline-3">
<h3 id="org82e35b2"><span class="section-number-3">2.5.</span> One Segment Diverging Maps</h3>
<div class="outline-text-3" id="text-2-5">
<p>
One edge trees in the face diagonal graph with a nearly constant intensity of 2 along the entire edge are useful for "diverging" or "bipolar" color
schemes.  By definition, such color schemes will never involve black or white.
</p>

<p>
While rarely used, the following maps are useful and suggested.  None of them have the problems associated with the color cube rainbow.
</p>

<ul class="org-ul">
<li><code>YC</code> &#x2013; <code>csCCudBr</code></li>
<li><code>YM</code> &#x2013; <code>csCCudBg</code></li>
<li><code>MC</code> &#x2013; <code>csCCudGr</code></li>
<li><code>MY</code> &#x2013; <code>csCCudGb</code></li>
<li><code>CM</code> &#x2013; <code>csCCudRg</code></li>
<li><code>CY</code> &#x2013; <code>csCCudRb</code></li>
</ul>

<p>
The naming convention for the methods is not obvious.  Take, for example, setRGBcmpUpDownRampBr.  This is so named because of the computational algorithm
used to compute the scheme: Blue up, red down, green constant (maxChanVal).
</p>
</div>
</div>

<div id="outline-container-org03bf917" class="outline-3">
<h3 id="org03bf917"><span class="section-number-3">2.6.</span> Three Segment Diverging Maps</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Some three edge trees utilizing very different colors for starting and terminal points can form very nice "divergent" color maps.  Such maps can
successfully illustrate variables with both positive and negative values or two mutually exclusive, opposing variables.  Only two are directly
supported via named methods (selected for attractiveness):
</p>

<ul class="org-ul">
<li><code>BWR</code> &#x2013; intensity between 1 and 3</li>
<li><code>CWM</code> &#x2013; intensity between 2 and 3</li>
</ul>
</div>
</div>
