docs/ColorSchemes.org
** Center point ramps (HSL schemes)

 Color schemes from the HSL color space are popular because they are perceptually more linear.  The most popular maps extend from the center of HSL space,
 (0.0, 0.5, 0), to one of the primary color vertexes --- which have the same colors as the vertexes of the RGB cube excluding black and white.  These
 sequences are identical to ones from the center of RGB space, (0.5, 0.5, 0.5), to one of the vertexes excluding black and white!  So we can implement these
 color schemes directly in RGB color space much as we have the cube schemes above.

 Recall that we call the vertex at the center of the cube "=H=" -- for "Half way between everything". Using this new vertex, we have the following saturation
 based color schemes:

  - =HR= -- =csHSLhR=
  - =HG= -- =csHSLhG=
  - =HB= -- =csHSLhB=
  - =HC= -- =csHSLhC=
  - =HY= -- =csHSLhY=
  - =HM= -- =csHSLhM=

 The traversal from black to white -- through the center point -- is directly supported via a named method.  Note that cmpRGBcornerGradiant() supports this via
 a graph string of "0W".

  - =0W= -- =csCCdiag01=

 The other diagonal traversals (diagonal meaning through the center of the cube) are essentially two of the HSL saturation based schemes placed back to back.
 They can form effective divergent color schemes.  Black to white is technically one of them, but we have already covered that one.  Note that the
 cmpRGBcornerGradiant() function will support this class of schemes with a two element graph -- the first vertex and the last. The remaining three diagonal schemes
 are as follows:

  - =CR= -- =csCCdiagCR=
  - =MG= -- =csCCdiagMG=
  - =YB= -- =csCCdiagYB=

