docs/ColorSchemes.html

<div id="outline-container-org28ba40c" class="outline-3">
<h3 id="org28ba40c"><span class="section-number-3">2.7.</span> Center point ramps (HSL schemes)</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Color schemes from the HSL color space are popular because they are perceptually more linear.  The most popular maps extend from the center of HSL space,
(0.0, 0.5, 0), to one of the primary color vertexes &#x2014; which have the same colors as the vertexes of the RGB cube excluding black and white.  These
sequences are identical to ones from the center of RGB space, (0.5, 0.5, 0.5), to one of the vertexes excluding black and white!  So we can implement these
color schemes directly in RGB color space much as we have the cube schemes above.
</p>

<p>
Recall that we call the vertex at the center of the cube "<code>H</code>" &#x2013; for "Half way between everything". Using this new vertex, we have the following saturation
based color schemes:
</p>

<ul class="org-ul">
<li><code>HR</code> &#x2013; <code>csHSLhR</code></li>
<li><code>HG</code> &#x2013; <code>csHSLhG</code></li>
<li><code>HB</code> &#x2013; <code>csHSLhB</code></li>
<li><code>HC</code> &#x2013; <code>csHSLhC</code></li>
<li><code>HY</code> &#x2013; <code>csHSLhY</code></li>
<li><code>HM</code> &#x2013; <code>csHSLhM</code></li>
</ul>

<p>
The traversal from black to white &#x2013; through the center point &#x2013; is directly supported via a named method.  Note that cmpRGBcolorRamp supports this via
a graph string of "0W".
</p>

<ul class="org-ul">
<li><code>0W</code> &#x2013; <code>csCCdiag01</code></li>
</ul>

<p>
The other diagonal traversals (diagonal meaning through the center of the cube) are essentially two of the HSL saturation based schemes placed back to back.
They can form effective divergent color schemes.  Black to white is technically one of them, but we have already covered that one.  Note that the
cmpRGBcolorRamp function will support this class of schemes with a two element graph &#x2013; the first vertex and the last. The remaining three diagonal schemes
are as follows:
</p>

<ul class="org-ul">
<li><code>CR</code> &#x2013; <code>csCCdiagCR</code></li>
<li><code>MG</code> &#x2013; <code>csCCdiagMG</code></li>
<li><code>YB</code> &#x2013; <code>csCCdiagYB</code></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
</div>
</body>
</html>
